{"config": [{"config": {"padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "filters": 32, "kernel_size": [5, 5], "use_bias": true, "data_format": "channels_last", "batch_input_shape": [null, 1, 28, 28], "bias_constraint": null, "name": "conv2d_1", "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "same", "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "filters": 64, "kernel_size": [5, 5], "use_bias": true, "data_format": "channels_last", "batch_input_shape": [null, 32, 14, 14], "bias_constraint": null, "name": "conv2d_2", "activation": "linear", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "same", "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 1024, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"units": 10, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "bias_constraint": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}